martinroger/superPod/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.1.0 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s31"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_I2S_BCLK_PIN=45
CONFIG_I2S_WS_PIN=46
CONFIG_I2S_DOUT_PIN=47
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=n
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y
CONFIG_BT_ACL_CONNECTIONS=1
CONFIG_BT_GATTC_NOTIF_REG_MAX=20
CONFIG_BT_CTRL_SLEEP_ENABLE=y
CONFIG_BT_CTRL_LP_CLK_SRC_MAIN_XTAL=y
CONFIG_BT_BLE_FEAT_ISO_EN=y
CONFIG_BT_LE_ISO_SUPPORT=y
CONFIG_BT_ISO_MAX_CHAN=2
CONFIG_BT_ASCS_MAX_ACTIVE_ASES=4
CONFIG_BT_BAP_UNICAST_SERVER=y
CONFIG_BT_AUDIO_CODEC_CFG_MAX_METADATA_SIZE=60
CONFIG_BT_PAC_SNK_NOTIFIABLE=y
CONFIG_BT_PAC_SNK_LOC_WRITEABLE=y
CONFIG_BT_PAC_SNK_LOC_NOTIFIABLE=y
CONFIG_BT_PAC_SRC_NOTIFIABLE=y
CONFIG_BT_PAC_SRC_LOC_WRITEABLE=y
CONFIG_BT_PAC_SRC_LOC_NOTIFIABLE=y
CONFIG_BT_PACS_SUPPORTED_CONTEXT_NOTIFIABLE=y
CONFIG_LIBC_NEWLIB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=1
CONFIG_FATFS_LFN_NONE=y
CONFIG_FATFS_USE_DYN_BUFFERS=n
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_IN_IRAM=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_MBEDTLS_THREADING_C=n
CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE=y
CONFIG_MBEDTLS_LARGE_KEY_SOFTWARE_MPI=n
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_0=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=n
CONFIG_TINYUSB_DESC_CUSTOM_VID=0x67b
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x2303
CONFIG_TINYUSB_DESC_BCD_DEVICE=0x400
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="Spoolific"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="ESPL2303"
CONFIG_TINYUSB_DESC_SERIAL_STRING=""
CONFIG_TINYUSB_VENDOR_COUNT=1
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_BT_MCTL=y
CONFIG_BT_MCTL_REMOTE_PLAYER_CONTROL=y
CONFIG_BT_MCC=y
CONFIG_BT_MCC_TRACK_TITLE_MAX=128
CONFIG_BT_MCC_READ_TRACK_TITLE=y
CONFIG_BT_MCC_READ_TRACK_TITLE_ENABLE_SUBSCRIPTION=y
CONFIG_BT_MCC_READ_TRACK_DURATION=y
CONFIG_BT_MCC_READ_TRACK_POSITION=y
CONFIG_BT_MCC_SET_TRACK_POSITION=y
CONFIG_BT_MCC_READ_MEDIA_STATE=y
CONFIG_BT_MCC_SET_MEDIA_CONTROL_POINT=y
CONFIG_BT_MCC_READ_MEDIA_CONTROL_POINT_OPCODES_SUPPORTED=y
CONFIG_BT_VCP_VOL_REND=y
CONFIG_BT_VCP_VOL_REND_VOL_FLAGS_NOTIFIABLE=y
CONFIG_BT_CAP_ACCEPTOR=y
CONFIG_BT_GATT_MAX_SR_PROFILES=12
CONFIG_BT_GATTC_NOTIF_REG_MAX=64
CONFIG_BT_PAC_SNK_NOTIFIABLE=y
CONFIG_BT_PAC_SNK_LOC_WRITEABLE=y
CONFIG_BT_PAC_SNK_LOC_NOTIFIABLE=y
CONFIG_BT_PACS_SUPPORTED_CONTEXT_NOTIFIABLE=y
CONFIG_BT_TMAP=y
